In [1]:
import pandas as pd
import matplotlib.pyplot as plt

### Cargamos el archivo 
*"Poblacion.csv"*

In [2]:
# cargo el archivo para volverlo un df
df = pd.read_csv(r'D:\0_Respaldo\0_Proyectos_2024\Henry_Labs\Lab2\Baires_Accidents\Data\Poblacion.csv', encoding='Latin-1')

In [4]:
df.sample(3)

,Comuna,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022,2023,2024,2025
0,Total,"3,028,481","3,033,639","3,038,860","3,044,076","3,049,229","3,054,267","3,059,122","3,063,728","3,068,043","3,072,029","3,075,646","3,078,836","3,081,550","3,083,770","3,085,483","3,086,680"
1,1,"243,946","245,308","246,689","248,069","249,433","250,770","252,053","253,271","254,408","255,457","256,405","257,235","257,934","258,497","258,922","259,205"
14,14,"226,489","226,558","226,626","226,692","226,758","226,821","226,884","226,944","227,003","227,060","227,115","227,168","227,219","227,268","227,315","227,360"

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 17 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Comuna  16 non-null     object
 1   2010    16 non-null     object
 2   2011    16 non-null     object
 3   2012    16 non-null     object
 4   2013    16 non-null     object
 5   2014    16 non-null     object
 6   2015    16 non-null     object
 7   2016    16 non-null     object
 8   2017    16 non-null     object
 9   2018    16 non-null     object
 10  2019    16 non-null     object
 11  2020    16 non-null     object
 12  2021    16 non-null     object
 13  2022    16 non-null     object
 14  2023    16 non-null     object
 15  2024    16 non-null     object
 16  2025    16 non-null     object
dtypes: object(17)
memory usage: 2.3+ KB

In [6]:
df.describe()

,Comuna,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022,2023,2024,2025
count,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16
unique,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16
top,Total,"3,028,481","3,033,639","3,038,860","3,044,076","3,049,229","3,054,267","3,059,122","3,063,728","3,068,043","3,072,029","3,075,646","3,078,836","3,081,550","3,083,770","3,085,483","3,086,680"
freq,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1

### Creo el dataframe con las columnas que trabajare. Periodo (2021-2020)

In [47]:
df1= df[['Comuna','2021','2020']].copy()
df1

   Comuna       2021       2020
0   Total  3,078,836  3,075,646
1       1    257,235    256,405
2       2    149,371    149,430
3       3    193,425    193,276
4       4    240,437    240,100
5       5    187,670    187,518
6       6    185,620    185,456
7       7    242,188    241,861
8       8    229,541    228,953
9       9    171,444    171,264
10     10    170,677    170,592
11     11    190,105    190,076
12     12    215,002    214,777
13     13    236,468    236,358
14     14    227,168    227,115
15     15    182,485    182,465

In [48]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Comuna  16 non-null     object
 1   2021    16 non-null     object
 2   2020    16 non-null     object
dtypes: object(3)
memory usage: 516.0+ bytes

In [49]:
#Elimino las comas de las columnas. Y despues los convierto en tipo int.
df1['2020'] = df1['2020'].str.replace(',', '').astype(int)
df1['2021'] = df1['2021'].str.replace(',', '').astype(int)

In [50]:
df1.head(3)

  Comuna     2021     2020
0  Total  3078836  3075646
1      1   257235   256405
2      2   149371   149430

In [51]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Comuna  16 non-null     object
 1   2021    16 non-null     int32
 2   2020    16 non-null     int32
dtypes: int32(2), object(1)
memory usage: 388.0+ bytes

### EDA Columna 'Comuna'

In [52]:
#Renombro la columna Comuna
df1 = df1.rename(columns={'Comuna':'COMUNA'})

In [53]:
df1.head(3)

  COMUNA     2021     2020
0  Total  3078836  3075646
1      1   257235   256405
2      2   149371   149430

In [54]:
#Modifico el valor de 'Total' y lo remplazo por '0'
df1.at[0, 'COMUNA'] = '0'

In [55]:
df1.head(3)

  COMUNA     2021     2020
0      0  3078836  3075646
1      1   257235   256405
2      2   149371   149430

In [56]:
#convierto los valores de la columna comuna al tipo int
df1['COMUNA'] = df1['COMUNA'].astype(int)

In [57]:
df1.head(3)

   COMUNA     2021     2020
0       0  3078836  3075646
1       1   257235   256405
2       2   149371   149430

### Reviso para valores NAN

In [58]:
df1.isna().sum()

COMUNA    0
2021      0
2020      0
dtype: int64

### Exporto los datos

In [59]:
df1.to_parquet(r"D:\0_Respaldo\0_Proyectos_2024\Henry_Labs\Lab2\Baires_Accidents\Data\Parquet\poblacion.parquet", index=False)